pipeHeatTransfer/case/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 773;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 773;
    }

    outlet
    {
        type            zeroGradient;
    }

    pipe
    {
        type            fixedGradient;
        gradient        uniform 57e3; // Значение градиента температуры (q/k)
        value           uniform 773;
    }
}

// ************************************************************************* //
