pipeHeatTransfer/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // p_rgh
    // {
    //     solver          PCG;
    //     smoother        GaussSeidel;
    //     preconditioner  DIC;
    //     tolerance       1e-06;
    //     relTol          0.01;
    // }

    p_rgh
    {
                solver  GAMG;
                smoother        GaussSeidel;
                relTol  1.0E-2;
                cacheAgglomeration      true;
                nFinestSweeps   2;
                nPreSweeps      0;
                maxIter 1000;
                nPostSweeps     1;
                agglomerator    faceAreaPair;
                nCellsInCoarsestLevel   10;
                tolerance       1.0E-6;
                mergeLevels     1;
    }

    p_rghFinal
    {
                solver  GAMG;
                smoother        GaussSeidel;
                relTol  1.0E-2;
                cacheAgglomeration      true;
                nFinestSweeps   2;
                nPreSweeps      0;
                maxIter 1000;
                nPostSweeps     1;
                agglomerator    faceAreaPair;
                nCellsInCoarsestLevel   10;
                tolerance       1.0E-6;
                mergeLevels     1;
                minIter 1;
    }


    "(U|k|epsilon)"
    {
        solver          PBiCGStab;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          1e-4;
    }

    T
    {
        solver  GAMG;
        smoother        GaussSeidel;
        relTol  1.0E-5;
        cacheAgglomeration      true;
        nFinestSweeps   2;
        nPreSweeps      0;
        maxIter         500;
        nPostSweeps     1;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel   10;
        tolerance       1.0E-7;
        mergeLevels     1;
    }

    cellDisplacement
    {
        $p_rgh;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 5;
    // pRefCell        0;
    // pRefValue       0;

    residualControl
    {
        p_rgh           1e-2;
        U               1e-4;
        T               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.4;
    }
    equations
    {
        U               0.65;
        T               1.0;
        "(k|epsilon)"   0.7;
    }
}


// ************************************************************************* //
